using System.Collections.Generic;

namespace Algorithm
{
    /// <summary>
    /// 常量类
    ///     放置各种星象学计算参数
    /// </summary>
    public static class FortuneConstants
    {
        #region 天干、地支

        /// <summary>
        ///  天干
        /// </summary>
        public static string[] Tiangan = { "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸" };

        /// <summary>
        ///  地支
        /// </summary>
        public static string[] Dizhi = { "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥" };

        /// <summary>
        ///  地支藏干字典
        /// </summary>
        public static Dictionary<string, string> DicHiddenTiangan = new Dictionary<string, string>
        {
            {"子", "癸"},
            {"丑", "己,癸,辛"},
            {"寅", "甲,丙,戊"},
            {"卯", "乙"},
            {"辰", "戊,乙,癸"},
            {"巳", "丙,戊,庚"},
            {"午", "丁,己"},
            {"未", "己,丁,乙"},
            {"申", "庚,壬,戊"},
            {"酉", "辛"},
            {"戌", "戊,辛,丁"},
            {"亥", "壬,甲"},
            //{"亥", "壬,甲,戊"},
        };

        /// <summary>
        ///  天干编号字典
        /// </summary>
        public static Dictionary<string, int> DicTianganIndex = new Dictionary<string, int>
        {
            {"甲",1},{"乙",2},{"丙",3},{"丁",4},{"戊",5},{"己",6},{"庚",7},{"辛",8},{"壬",9},{"癸",10},
        };

        /// <summary>
        ///  地支编号字典
        /// </summary>
        public static Dictionary<string, int> DicDizhiIndex = new Dictionary<string, int>
        {
            {"子",1},{"丑",2},{"寅",3},{"卯",4},{"辰",5},{"巳",6},{"午",7},{"未",8},{"申",9},{"酉",10},{"戌",11},{"亥",12},
        };

        #endregion

        #region 农历、节气月份

        /// <summary>
        /// 农历月份汉字与数字对应关系集合
        /// </summary>
        public static Dictionary<string, int> DicLunarMonth = new Dictionary<string, int>
        {
            {"一", 1}, {"二", 2}, {"三", 3}, {"四", 4}, {"五", 5}, {"六", 6}, {"七", 7}, {"八", 8}, {"九", 9}, {"十", 10}, {"十一", 11}, {"十二", 12},
            {"正", 1}, {"冬",11}, {"腊",12}, 
            {"闰一", 1},{"闰二", 2},{"闰三", 3},{"闰四", 4},{"闰五", 5},{"闰六", 6},{"闰七", 7},{"闰八", 8},{"闰九", 9},{"闰十", 10},{"闰十一", 11},{"闰十二", 12},
            {"闰正", 1},{"闰冬", 11},{"闰腊", 12},
        };

        /// <summary>
        ///  节气对应的月份编号关系集（只限用于中间计算）
        /// </summary>
        public static Dictionary<string, int> DicSolarTermMonth = new Dictionary<string, int>
        {
            {"立春",1},{"雨水",1},{"惊蛰",2},{"春分",2},{"清明",3},{"谷雨",3},{"立夏",4},{"小满",4},{"芒种",5},{"夏至",5},{"小暑",6},{"大暑",6},
            {"立秋",7},{"处暑",7},{"白露",8},{"秋分",8},{"寒露",9},{"霜降",9},{"立冬",10},{"小雪",10},{"大雪",11},{"冬至",11},{"小寒",12},{"大寒",12}
        };

        #endregion

        #region 五行相关

        /// <summary>
        ///  天干五行关系集合
        /// </summary>
        public static Dictionary<string, string> DicTianganWuxing = new Dictionary<string, string>
        {
            {"甲","木"},{"乙","木"},{"丙","火"},{"丁","火"},{"戊","土"},{"己","土"},{"庚","金"},{"辛","金"},{"壬","水"},{"癸","水"},
        };

        /// <summary>
        ///  地支五行关系集合
        /// </summary>
        public static Dictionary<string, string> DicDizhiWuxing = new Dictionary<string, string>
        {
            {"子","水"},{"丑","土"},{"寅","木"},{"卯","木"},{"辰","土"},{"巳","火"},{"午","火"},{"未","土"},{"申","金"},{"酉","金"},{"戌","土"},{"亥","水"},
        };

        /// <summary>
        ///  五行方位字典
        /// </summary>
        public static Dictionary<string, string> DicWuxingDirection = new Dictionary<string, string>
        {
            {"木","东"},{"火","南"},{"土","中"},{"金","西"},{"水","北"},
        };

        /// <summary>
        ///  五行相生相克关系
        /// </summary>
        public static Dictionary<string, string> DicWuxingRelations = new Dictionary<string, string>
        {
            {"金水","生"},{"水木","生"},{"木火","生"},{"火土","生"},{"土金","生"}, // 相生
            {"水金","被生"},{"木水","被生"},{"火木","被生"},{"土火","被生"},{"金土","被生"}, // 相生
            {"金木","克"},{"木土","克"},{"土水","克"},{"水火","克"},{"火金","克"}, // 相克
            {"木金","被克"},{"土木","被克"},{"水土","被克"},{"火水","被克"},{"金火","被克"}, // 相克
            {"金金",""},{"木木",""},{"水水",""},{"火火",""},{"土土",""}, 
        };

        /// <summary>
        ///  五行生克与日干关系
        /// </summary>
        public static Dictionary<string, string> DicWuxingDayTianganRelations = new Dictionary<string, string>
        {
            {"生","日干生"},{"被生","生日干"},{"克","日干克"},{"被克","克日干"},{"","同日干"},
        };

        /// <summary>
        ///  日生干字典
        /// </summary>
        public static Dictionary<string, string> DicWuxingRelationSource = new Dictionary<string, string>
        {
            {"生水", "金"},{"生木", "水"},{"生火", "木"},{"生土", "火"},{"生金", "土"}
        };

        /// <summary>
        ///  地支藏干的分值比重
        /// </summary>
        public static Dictionary<string, int> DicWuxingHiddenTianganScore = new Dictionary<string, int>
        {
            {"子癸", 100},    {"丑己",60},{"丑癸", 30},{"丑辛", 10},    {"寅甲", 60},{"寅丙", 30},{"寅戊",10},    {"卯乙",100},     
            {"辰戊",60},{"辰乙",30},{"辰癸",10},      {"巳丙",60},{"巳戊",30},{"巳庚",10},      {"午丁", 70},{"午己",30},
            {"未己",60},{"未丁",30},{"未乙",10},      {"申庚",60},{"申壬",30},{"申戊",10},      {"酉辛",100},
            {"戌戊",60},{"戌辛",30},{"戌丁",10},      {"亥壬",70},{"亥甲",30}
        };

        /// <summary>
        ///  五行月份旺度系数（五行-月地支）
        /// </summary>
        public static Dictionary<string, double> DicWuxingCoefficient = new Dictionary<string, double>
        {
            {"寅木",1.571 },{"寅火",1.548 },{"寅土",0.924 },{"寅金",0.716 },{"寅水",0.862 },
            {"卯木",2.000 },{"卯火",1.414 },{"卯土",0.500 },{"卯金",0.707 },{"卯水",1.000 },
            {"辰木",1.166 },{"辰火",1.074 },{"辰土",1.421 },{"辰金",1.161 },{"辰水",0.800 },
            {"巳木",0.862 },{"巳火",1.571 },{"巳土",1.548 },{"巳金",0.924 },{"巳水",0.716 },
            {"午木",0.912 },{"午火",1.700 },{"午土",1.590 },{"午金",0.774 },{"午水",0.645 },
            {"未木",0.924 },{"未火",1.341 },{"未土",1.674 },{"未金",1.069 },{"未水",0.612 },
            {"申木",0.795 },{"申火",0.674 },{"申土",1.012 },{"申金",1.641 },{"申水",1.498 },
            {"酉木",0.500 },{"酉火",0.707 },{"酉土",1.000 },{"酉金",2.000 },{"酉水",1.414 },
            {"戌木",0.674 },{"戌火",1.012 },{"戌土",1.641 },{"戌金",1.498 },{"戌水",0.795 },
            {"亥木",1.590 },{"亥火",0.774 },{"亥土",0.645 },{"亥金",0.912 },{"亥水",1.700 },
            {"子木",1.414 },{"子火",0.500 },{"子土",0.707 },{"子金",1.000 },{"子水",2.000 },
            {"丑木",0.898 },{"丑火",0.821 },{"丑土",1.512 },{"丑金",1.348 },{"丑水",1.041 },
        };

        #endregion

        #region 阴阳相关

        /// <summary>
        ///  天干阴阳关系集合
        /// </summary>
        public static Dictionary<string, string> DicTianganYinyang = new Dictionary<string, string>
        {
            { "甲", "阳" }, { "丙", "阳" }, { "戊", "阳" }, { "庚", "阳" }, { "壬", "阳" }, { "乙", "阴" }, { "丁", "阴" }, { "己", "阴" }, { "辛", "阴" }, { "癸", "阴" },
        };

        /// <summary>
        ///  阴阳关系描述
        /// </summary>
        public static Dictionary<string, string> DicYinyangDesc = new Dictionary<string, string>
        {
            {"阴阳","与日干阴阳不同"},
            {"阳阴","与日干阴阳不同"},
            {"阴阴","与日干阴阳相同"},
            {"阳阳","与日干阴阳相同"},
        };

        #endregion

        #region 十神相关

        /// <summary>
        ///  十神字典
        /// </summary>
        public static Dictionary<string, string> DicShishen = new Dictionary<string, string>
        {
            {"与日干阴阳不同，生日干", "正印"},
            {"与日干阴阳相同，生日干", "枭神"},
            {"与日干阴阳相同，克日干", "七杀"},
            {"与日干阴阳不同，克日干", "正官"},
            {"与日干阴阳不同，同日干", "劫财"},
            {"与日干阴阳相同，同日干", "比肩"},
            {"与日干阴阳不同，日干生", "伤官"},
            {"与日干阴阳相同，日干生", "食神"},
            {"与日干阴阳不同，日干克", "正财"},
            {"与日干阴阳相同，日干克", "偏财"}
        };


        #endregion

        #region 长生十二神

        public static string[] TwelveGods = { "長生", "沐浴", "冠带", "临官", "帝旺", "衰", "病", "死", "墓", "绝", "胎", "养" };

        /// <summary>
        ///  长生十二神表
        /// </summary>
        public static Dictionary<string, string> DicTwelveGodsTable = new Dictionary<string, string>
        {
            {"甲亥","長生"},{"乙午","長生"},{"丙寅","長生"},{"丁酉","長生"},{"戊寅","長生"},{"己酉","長生"},{"庚巳","長生"},{"辛子","長生"},{"壬申","長生"},{"癸卯","長生"},
            {"甲子","沐浴"},{"乙巳","沐浴"},{"丙卯","沐浴"},{"丁申","沐浴"},{"戊卯","沐浴"},{"己申","沐浴"},{"庚午","沐浴"},{"辛亥","沐浴"},{"壬酉","沐浴"},{"癸寅","沐浴"},
            {"甲丑","冠带"},{"乙辰","冠带"},{"丙辰","冠带"},{"丁未","冠带"},{"戊辰","冠带"},{"己未","冠带"},{"庚未","冠带"},{"辛戌","冠带"},{"壬戌","冠带"},{"癸丑","冠带"},
            {"甲寅","临官"},{"乙卯","临官"},{"丙巳","临官"},{"丁午","临官"},{"戊巳","临官"},{"己午","临官"},{"庚申","临官"},{"辛酉","临官"},{"壬亥","临官"},{"癸子","临官"},
            {"甲卯","帝旺"},{"乙寅","帝旺"},{"丙午","帝旺"},{"丁巳","帝旺"},{"戊午","帝旺"},{"己巳","帝旺"},{"庚酉","帝旺"},{"辛申","帝旺"},{"壬子","帝旺"},{"癸亥","帝旺"},
            {"甲辰","衰"},{"乙丑","衰"},{"丙未","衰"},{"丁辰","衰"},{"戊未","衰"},{"己辰","衰"},{"庚戌","衰"},{"辛未","衰"},{"壬丑","衰"},{"癸戌","衰"},
            {"甲巳","病"},{"乙子","病"},{"丙申","病"},{"丁卯","病"},{"戊申","病"},{"己卯","病"},{"庚亥","病"},{"辛午","病"},{"壬寅","病"},{"癸酉","病"},
            {"甲午","死"},{"乙亥","死"},{"丙酉","死"},{"丁寅","死"},{"戊酉","死"},{"己寅","死"},{"庚子","死"},{"辛巳","死"},{"壬卯","死"},{"癸申","死"},
            {"甲未","墓"},{"乙戌","墓"},{"丙戌","墓"},{"丁丑","墓"},{"戊戌","墓"},{"己丑","墓"},{"庚丑","墓"},{"辛辰","墓"},{"壬辰","墓"},{"癸未","墓"},
            {"甲申","绝"},{"乙酉","绝"},{"丙亥","绝"},{"丁子","绝"},{"戊亥","绝"},{"己子","绝"},{"庚寅","绝"},{"辛卯","绝"},{"壬巳","绝"},{"癸午","绝"},
            {"甲酉","胎"},{"乙申","胎"},{"丙子","胎"},{"丁亥","胎"},{"戊子","胎"},{"己亥","胎"},{"庚卯","胎"},{"辛寅","胎"},{"壬午","胎"},{"癸巳","胎"},
            {"甲戌","养"},{"乙未","养"},{"丙丑","养"},{"丁戌","养"},{"戊丑","养"},{"己戌","养"},{"庚辰","养"},{"辛丑","养"},{"壬未","养"},{"癸辰","养"},
        };

        #endregion

    }
}